<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"e2552f04d1d39aea258b9c386a2e4b2a5b8dc9075550956edb5659a8e3a78d92","plan_job_ref":"Job Plan Airflow DAGs #249 at https://github.com/cal-itp/data-infra/actions/runs/16209361012","plan_out_hash":"88fbb3845ad53373dfb99fedf0bed6fe5be8f550293e35e33174a1c4c192c707","plan_hash":"f2cfe2e1805fb05b6aeb956028c19a4abed59b0a2e4ec7e557451d35d677d893","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "0MvR1A==" -> (known after apply)
!~      detect_md5hash      = "ywugIlUZagDiCHTvCgCd/A==" -> "different hash"
!~      generation          = 1752188818639284 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "ywugIlUZagDiCHTvCgCd/A==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "5rnSGw==" -> (known after apply)
!~      detect_md5hash      = "S7QmrKUvBe0feksd/+70Ww==" -> "different hash"
!~      generation          = 1752188820132103 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "S7QmrKUvBe0feksd/+70Ww==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
!~      content             = (sensitive value)
!~      crc32c              = "KvxdLg==" -> (known after apply)
!~      detect_md5hash      = "kh10Bt2VtvG+0yNnA5q1/Q==" -> "different hash"
!~      generation          = 1752103419390838 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
!~      md5hash             = "kh10Bt2VtvG+0yNnA5q1/Q==" -> (known after apply)
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #249](https://github.com/cal-itp/data-infra/actions/runs/16209361012)